src/CF/Reports/ОтчетРуководителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ОтчетРуководителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыданоСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадолженностьСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозицийНоменклатурыВОстатках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КупленоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КупленоНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстатокДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоСотрудникам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборотДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяВаловаяПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиТоваровКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиТоваровНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоСкладу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРасчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПереоценка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПокупка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяПродажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилоТоваровНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданоКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданоНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаноКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаноНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееКоличествоРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредняяСуммаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДолгКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДолгПередПоставщиками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийОстатокДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПредприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/CF/Reports/ОтчетРуководителю/Forms/ФормаОтчета/Ext/Form/Module.bsl
//sza140114-0212 : 
//sza130831-0257

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	элементы.Взаиморасчеты.Видимость = УчетПоКлиентам;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
		Отчет.ДатаНачала 	= началоГода(ОбщийМодульКлиент.ПользователяТекущаяДата());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		Отчет.ДатаОкончания = ОбщийМодульКлиент.ПользователяТекущаяДата();
	КонецЕсли;
	Отчет.ПериодОтчета.ДатаНачала 		= Отчет.ДатаНачала;	
	Отчет.ПериодОтчета.ДатаОкончания 	= Отчет.ДатаОкончания;
	
	Отчет.ПериодОтчета.ДатаНачала 		= отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания 	= отчет.ДатаОкончания;
	Если НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
	сформироватьотчетсразу();	
							 КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	
	отчет.датаначала = ОбщийМодульКлиент.ПользователяТекущаяДата();
	отчет.датаокончания = ОбщийМодульКлиент.ПользователяТекущаяДата();
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	сформироватьотчетсразу(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Вчера(Команда)
	
	отчет.ДатаНачала = началодня(началодня(ОбщийМодульСервисСервер.ПользователяТекущаяДата()) - 100);
	отчет.ДатаОкончания = конецдня(отчет.ДатаНачала);
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтотМесяц(Команда)
	
	отчет.ДатаНачала = началомесяца(ОбщийМодульКлиент.ПользователяТекущаяДата());
	отчет.ДатаОкончания = конецмесяца(ОбщийМодульКлиент.ПользователяТекущаяДата());
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесьПериод(Команда)
	
	отчет.ДатаНачала    = ОбщийМодульСервисСервер.ДатаПервогоДокумента();
	отчет.ДатаОкончания = конецгода(ОбщийМодульКлиент.ПользователяТекущаяДата());
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати");
	ОбщийМодульСервер.ПечатьНаСервереОтчетаРуководителю(СтруктураДанныхОтчета(), ФормаПечати.Результат);

	ФормаПечати.Результат.ОтображатьСетку 	= Ложь;
	ФормаПечати.Результат.Защита 			= Истина;
	ФормаПечати.Результат.ТолькоПросмотр 	= Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Отчет руководителю");
	ФормаПечати.открыть();	
	
КонецПроцедуры

&НаСервере
Функция   СтруктураДанныхОтчета()
	
	РезультатСтруктураДанныхОтчета = Новый Структура;
	
	Реквизиты = метаданные.Отчеты.ОтчетРуководителю.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		РезультатСтруктураДанныхОтчета.Вставить(Реквизит.Имя, Отчет[Реквизит.Имя]);
	КонецЦикла;	
	
	Возврат РезультатСтруктураДанныхОтчета;
	
КонецФункции //СтруктураДанныхОтчета

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	
	Отчет.ДатаНачала = Отчет.ПериодОтчета.ДатаНачала;
	Отчет.ДатаОкончания = Отчет.ПериодОтчета.ДатаОкончания;
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;
	Если отчет.ДатаНачала > Отчет.ДатаОкончания Тогда
		Отчет.ДатаОкончания = отчет.ДатаНачала;
		отчет.ПериодОтчета.ДатаОкончания = Отчет.ДатаОкончания;
	КонецЕсли;
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;
	Если отчет.ДатаНачала > Отчет.ДатаОкончания Тогда
		отчет.ДатаНачала = Отчет.ДатаОкончания;
		отчет.ПериодОтчета.ДатаНачала = Отчет.ДатаНачала;
	КонецЕсли;
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	УчетПоКлиентам = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам");
	элементы.ВзаиморасчетыСПоставщиками.Видимость 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам") ;
	элементы.Деньги.Видимость 						= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") ;
	Элементы.КромеДолговПоТоварам.Видимость 		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников") ;
	Элементы.ОтправитьРуководителю.Видимость 		= не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЭлектроннаяПочтаОтправитель") = "";
	элементы.ОбщаяВаловаяПрибыль.Видимость 			= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВаловойПрибыли");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПлюсДень(Команда)
	
	отчет.ДатаНачала = отчет.ДатаНачала + 3600 * 24;
	отчет.ДатаОкончания = отчет.ДатаОкончания + 3600 * 24;
	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;
	сформироватьотчетсразу();
	
КонецПроцедуры

&НаКлиенте
Процедура МинусДень(Команда)
	
	отчет.ДатаНачала = отчет.ДатаНачала - 3600 * 24;
	отчет.ДатаОкончания = отчет.ДатаОкончания - 3600 * 24;
	отчет.ПериодОтчета.ДатаНачала = отчет.ДатаНачала;
	отчет.ПериодОтчета.ДатаОкончания = отчет.ДатаОкончания;
	сформироватьотчетсразу();
	                              	
КонецПроцедуры

&НаКлиенте
процедура сформироватьотчетсразу(ИзКнопки = Ложь)
	
	Если изкнопки 
		или НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
		
		состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите. Формируется отчет.."));
		СтруктураОтчета = ОбщийМодульСервер.СформироватьОтчетРуководителюНаСервере(СтруктураУсловий());
		Если НЕ СтруктураОтчета = Неопределено Тогда
			ОформитьОтчет(СтруктураОтчета);
		КонецЕсли;
		ОбновитьИнтерфейс();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьОтчет(СтруктураОтчета)
	
	Реквизиты = метаданные.Отчеты.ОтчетРуководителю.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		Попытка 
			Отчет[Реквизит.имя] = СтруктураОтчета[Реквизит.имя];
		Исключение 	
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция   СтруктураУсловий()
	
	РезультатСтруктураУсловий = Новый Структура;
	РезультатСтруктураУсловий.Вставить("ДатаНачала", отчет.ДатаНачала);
	РезультатСтруктураУсловий.Вставить("ДатаОкончания", Отчет.ДатаОкончания);
	РезультатСтруктураУсловий.Вставить("ОтборПоСкладу", Отчет.ОтборПоСкладу);
	
	Возврат РезультатСтруктураУсловий;
	
КонецФункции //СтруктураУсловий()

&НаКлиенте
Процедура ОтборПоСкладуПриИзменении(Элемент)
	сформироватьотчетсразу();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРуководителю(Команда)
	
	Результат = Новый ТабличныйДокумент;
	ОбщийМодульСервер.ПечатьНаСервереОтчетаРуководителю(СтруктураДанныхОтчета(), Результат);
	ОбщийМодульКлиент.ОтправитьПоEMAIL(Результат, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчет Руководителю"));
	
КонецПроцедуры
